###################################################################

# Created by write_sdc on Fri Nov 17 22:17:03 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_area 0
set_max_transition 0.3 [current_design]
set_load -pin_load 0.05 [get_ports m1_n]
set_load -pin_load 0.05 [get_ports mreq_n]
set_load -pin_load 0.05 [get_ports iorq_n]
set_load -pin_load 0.05 [get_ports rd_n]
set_load -pin_load 0.05 [get_ports wr_n]
set_load -pin_load 0.05 [get_ports rfsh_n]
set_load -pin_load 0.05 [get_ports halt_n]
set_load -pin_load 0.05 [get_ports busak_n]
set_load -pin_load 0.05 [get_ports A_15_]
set_load -pin_load 0.05 [get_ports A_14_]
set_load -pin_load 0.05 [get_ports A_13_]
set_load -pin_load 0.05 [get_ports A_12_]
set_load -pin_load 0.05 [get_ports A_11_]
set_load -pin_load 0.05 [get_ports A_10_]
set_load -pin_load 0.05 [get_ports A_9_]
set_load -pin_load 0.05 [get_ports A_8_]
set_load -pin_load 0.05 [get_ports A_7_]
set_load -pin_load 0.05 [get_ports A_6_]
set_load -pin_load 0.05 [get_ports A_5_]
set_load -pin_load 0.05 [get_ports A_4_]
set_load -pin_load 0.05 [get_ports A_3_]
set_load -pin_load 0.05 [get_ports A_2_]
set_load -pin_load 0.05 [get_ports A_1_]
set_load -pin_load 0.05 [get_ports A_0_]
set_load -pin_load 0.05 [get_ports do_7_]
set_load -pin_load 0.05 [get_ports do_6_]
set_load -pin_load 0.05 [get_ports do_5_]
set_load -pin_load 0.05 [get_ports do_4_]
set_load -pin_load 0.05 [get_ports do_3_]
set_load -pin_load 0.05 [get_ports do_2_]
set_load -pin_load 0.05 [get_ports do_1_]
set_load -pin_load 0.05 [get_ports do_0_]
set_ideal_network [get_ports MY_CLK]
create_clock [get_ports MY_CLK]  -period 15.44  -waveform {0 7.72}
group_path -name FEEDTHROUGH  -from [list [get_ports reset_n] [get_ports wait_n] [get_ports int_n] [get_ports nmi_n] [get_ports busrq_n] [get_ports di_7_] [get_ports di_6_] [get_ports di_5_] [get_ports di_4_] [get_ports di_3_] [get_ports di_2_] [get_ports di_1_] [get_ports di_0_]]  -to [list [get_ports m1_n] [get_ports mreq_n] [get_ports iorq_n] [get_ports rd_n] [get_ports wr_n] [get_ports rfsh_n] [get_ports halt_n] [get_ports busak_n] [get_ports A_15_] [get_ports A_14_] [get_ports A_13_] [get_ports A_12_] [get_ports A_11_] [get_ports A_10_] [get_ports A_9_] [get_ports A_8_] [get_ports A_7_] [get_ports A_6_] [get_ports A_5_] [get_ports A_4_] [get_ports A_3_] [get_ports A_2_] [get_ports A_1_] [get_ports A_0_] [get_ports do_7_] [get_ports do_6_] [get_ports do_5_] [get_ports do_4_] [get_ports do_3_] [get_ports do_2_] [get_ports do_1_] [get_ports do_0_]]
group_path -name REGIN  -from [list [get_ports reset_n] [get_ports wait_n] [get_ports int_n] [get_ports nmi_n] [get_ports busrq_n] [get_ports di_7_] [get_ports di_6_] [get_ports di_5_] [get_ports di_4_] [get_ports di_3_] [get_ports di_2_] [get_ports di_1_] [get_ports di_0_]]
group_path -name REGOUT  -to [list [get_ports m1_n] [get_ports mreq_n] [get_ports iorq_n] [get_ports rd_n] [get_ports wr_n] [get_ports rfsh_n] [get_ports halt_n] [get_ports busak_n] [get_ports A_15_] [get_ports A_14_] [get_ports A_13_] [get_ports A_12_] [get_ports A_11_] [get_ports A_10_] [get_ports A_9_] [get_ports A_8_] [get_ports A_7_] [get_ports A_6_] [get_ports A_5_] [get_ports A_4_] [get_ports A_3_] [get_ports A_2_] [get_ports A_1_] [get_ports A_0_] [get_ports do_7_] [get_ports do_6_] [get_ports do_5_] [get_ports do_4_] [get_ports do_3_] [get_ports do_2_] [get_ports do_1_] [get_ports do_0_]]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_i_tv80_core_mcycles_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_i_tv80_core_mcycles_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_i_tv80_core_mcycles_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_i_tv80_core_mcycles_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_i_tv80_core_BusAck_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_i_tv80_core_BusAck_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_i_tv80_core_BusAck_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_i_tv80_core_BusAck_reg/main_gate]
set_clock_gating_check -rise -setup 0 [get_cells clk_gate_i_tv80_core_BusB_reg/main_gate]
set_clock_gating_check -fall -setup 0 [get_cells clk_gate_i_tv80_core_BusB_reg/main_gate]
set_clock_gating_check -rise -hold 0 [get_cells clk_gate_i_tv80_core_BusB_reg/main_gate]
set_clock_gating_check -fall -hold 0 [get_cells clk_gate_i_tv80_core_BusB_reg/main_gate]
